KSMK1-Sketch/two-big-head-StepperMotor/2024CAR/ncontroller.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G350X" --package "LQFP-64(PM)" --part "Default" --product "mspm0_sdk@1.30.00.03"
 * @versions {"tool":"1.19.0+3426"}
 */

/**
 * Import the modules used in this configuration.
 */
const GPIO          = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1         = GPIO.addInstance();
const GPIO2         = GPIO.addInstance();
const GPIO3         = GPIO.addInstance();
const GPIO4         = GPIO.addInstance();
const GPIO5         = GPIO.addInstance();
const I2C           = scripting.addModule("/ti/driverlib/I2C", {}, false);
const I2C1          = I2C.addInstance();
const PWM           = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1          = PWM.addInstance();
const PWM2          = PWM.addInstance();
const SYSCTL        = scripting.addModule("/ti/driverlib/SYSCTL");
const TIMER         = scripting.addModule("/ti/driverlib/TIMER", {}, false);
const TIMER1        = TIMER.addInstance();
const TIMER2        = TIMER.addInstance();
const TIMER3        = TIMER.addInstance();
const UART          = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1         = UART.addInstance();
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
const gate7  = system.clockTree["MFCLKGATE"];
gate7.enable = true;

GPIO1.$name                          = "LED";
GPIO1.associatedPins.create(2);
GPIO1.associatedPins[0].$name        = "LEDG";
GPIO1.associatedPins[0].assignedPort = "PORTA";
GPIO1.associatedPins[0].assignedPin  = "2";
GPIO1.associatedPins[0].pin.$assign  = "PA2";
GPIO1.associatedPins[1].$name        = "LEDB";
GPIO1.associatedPins[1].assignedPort = "PORTB";
GPIO1.associatedPins[1].assignedPin  = "22";

const Board                       = scripting.addModule("/ti/driverlib/Board", {}, false);
Board.peripheral.$assign          = "DEBUGSS";
Board.peripheral.swclkPin.$assign = "PA20";
Board.peripheral.swdioPin.$assign = "PA19";

GPIO2.$name                          = "KEY";
GPIO2.associatedPins[0].$name        = "KEY1";
GPIO2.associatedPins[0].assignedPort = "PORTB";
GPIO2.associatedPins[0].assignedPin  = "21";
GPIO2.associatedPins[0].direction    = "INPUT";

GPIO3.$name                          = "TB6612";
GPIO3.associatedPins.create(8);
GPIO3.associatedPins[0].$name        = "AIN1";
GPIO3.associatedPins[0].initialValue = "SET";
GPIO3.associatedPins[0].assignedPin  = "14";
GPIO3.associatedPins[0].assignedPort = "PORTA";
GPIO3.associatedPins[1].$name        = "AIN2";
GPIO3.associatedPins[1].initialValue = "SET";
GPIO3.associatedPins[1].assignedPin  = "15";
GPIO3.associatedPins[1].assignedPort = "PORTA";
GPIO3.associatedPins[2].$name        = "BIN1";
GPIO3.associatedPins[2].initialValue = "SET";
GPIO3.associatedPins[2].assignedPin  = "12";
GPIO3.associatedPins[2].assignedPort = "PORTA";
GPIO3.associatedPins[3].$name        = "BIN2";
GPIO3.associatedPins[3].assignedPin  = "13";
GPIO3.associatedPins[3].initialValue = "SET";
GPIO3.associatedPins[3].assignedPort = "PORTA";
GPIO3.associatedPins[4].$name        = "CIN1";
GPIO3.associatedPins[4].initialValue = "SET";
GPIO3.associatedPins[4].assignedPort = "PORTB";
GPIO3.associatedPins[4].assignedPin  = "17";
GPIO3.associatedPins[5].$name        = "CIN2";
GPIO3.associatedPins[5].initialValue = "SET";
GPIO3.associatedPins[5].assignedPort = "PORTB";
GPIO3.associatedPins[5].assignedPin  = "18";
GPIO3.associatedPins[6].$name        = "DIN1";
GPIO3.associatedPins[6].initialValue = "SET";
GPIO3.associatedPins[6].assignedPin  = "8";
GPIO3.associatedPins[6].assignedPort = "PORTA";
GPIO3.associatedPins[7].$name        = "DIN2";
GPIO3.associatedPins[7].initialValue = "SET";
GPIO3.associatedPins[7].assignedPin  = "9";
GPIO3.associatedPins[7].assignedPort = "PORTA";

GPIO4.$name                               = "ENCODER";
GPIO4.associatedPins.create(8);
GPIO4.associatedPins[0].$name             = "E1A";
GPIO4.associatedPins[0].direction         = "INPUT";
GPIO4.associatedPins[0].assignedPin       = "27";
GPIO4.associatedPins[0].interruptEn       = true;
GPIO4.associatedPins[0].interruptPriority = "0";
GPIO4.associatedPins[0].polarity          = "RISE";
GPIO4.associatedPins[0].assignedPort      = "PORTA";
GPIO4.associatedPins[1].$name             = "E1B";
GPIO4.associatedPins[1].direction         = "INPUT";
GPIO4.associatedPins[1].assignedPin       = "26";
GPIO4.associatedPins[1].interruptEn       = true;
GPIO4.associatedPins[1].interruptPriority = "0";
GPIO4.associatedPins[1].polarity          = "RISE";
GPIO4.associatedPins[1].assignedPort      = "PORTA";
GPIO4.associatedPins[2].$name             = "E2A";
GPIO4.associatedPins[2].direction         = "INPUT";
GPIO4.associatedPins[2].assignedPin       = "31";
GPIO4.associatedPins[2].interruptEn       = true;
GPIO4.associatedPins[2].interruptPriority = "0";
GPIO4.associatedPins[2].polarity          = "RISE";
GPIO4.associatedPins[2].assignedPort      = "PORTA";
GPIO4.associatedPins[2].pin.$assign       = "PA31";
GPIO4.associatedPins[3].$name             = "E2B";
GPIO4.associatedPins[3].direction         = "INPUT";
GPIO4.associatedPins[3].assignedPin       = "28";
GPIO4.associatedPins[3].interruptEn       = true;
GPIO4.associatedPins[3].interruptPriority = "0";
GPIO4.associatedPins[3].polarity          = "RISE";
GPIO4.associatedPins[3].assignedPort      = "PORTA";
GPIO4.associatedPins[3].pin.$assign       = "PA28";
GPIO4.associatedPins[4].$name             = "E3A";
GPIO4.associatedPins[4].direction         = "INPUT";
GPIO4.associatedPins[4].interruptEn       = true;
GPIO4.associatedPins[4].interruptPriority = "0";
GPIO4.associatedPins[4].polarity          = "RISE";
GPIO4.associatedPins[4].assignedPort      = "PORTB";
GPIO4.associatedPins[4].assignedPin       = "10";
GPIO4.associatedPins[5].$name             = "E3B";
GPIO4.associatedPins[5].direction         = "INPUT";
GPIO4.associatedPins[5].interruptEn       = true;
GPIO4.associatedPins[5].interruptPriority = "0";
GPIO4.associatedPins[5].polarity          = "RISE";
GPIO4.associatedPins[5].assignedPort      = "PORTB";
GPIO4.associatedPins[5].assignedPin       = "11";
GPIO4.associatedPins[6].$name             = "E4A";
GPIO4.associatedPins[6].direction         = "INPUT";
GPIO4.associatedPins[6].interruptEn       = true;
GPIO4.associatedPins[6].interruptPriority = "0";
GPIO4.associatedPins[6].polarity          = "RISE";
GPIO4.associatedPins[6].assignedPort      = "PORTB";
GPIO4.associatedPins[6].assignedPin       = "12";
GPIO4.associatedPins[7].$name             = "E4B";
GPIO4.associatedPins[7].direction         = "INPUT";
GPIO4.associatedPins[7].interruptEn       = true;
GPIO4.associatedPins[7].interruptPriority = "0";
GPIO4.associatedPins[7].polarity          = "RISE";
GPIO4.associatedPins[7].assignedPort      = "PORTB";
GPIO4.associatedPins[7].assignedPin       = "13";

GPIO5.$name                          = "IIC_JY61P";
GPIO5.associatedPins.create(2);
GPIO5.associatedPins[0].initialValue = "SET";
GPIO5.associatedPins[0].ioStructure  = "OD";
GPIO5.associatedPins[0].assignedPort = "PORTA";
GPIO5.associatedPins[0].$name        = "SDA_JY61P";
GPIO5.associatedPins[0].assignedPin  = "1";
GPIO5.associatedPins[1].$name        = "SCL_JY61P";
GPIO5.associatedPins[1].initialValue = "SET";
GPIO5.associatedPins[1].assignedPort = "PORTA";
GPIO5.associatedPins[1].ioStructure  = "OD";
GPIO5.associatedPins[1].assignedPin  = "0";

I2C1.$name                             = "I2C_1";
I2C1.basicEnableController             = true;
I2C1.basicControllerStandardBusSpeed   = "Fast";
I2C1.peripheral.$assign                = "I2C1";
I2C1.peripheral.sdaPin.$assign         = "PB3";
I2C1.peripheral.sclPin.$assign         = "PB2";
I2C1.sdaPinConfig.hideOutputInversion  = scripting.forceWrite(false);
I2C1.sdaPinConfig.onlyInternalResistor = scripting.forceWrite(false);
I2C1.sdaPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
I2C1.sdaPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric9";
I2C1.sclPinConfig.hideOutputInversion  = scripting.forceWrite(false);
I2C1.sclPinConfig.onlyInternalResistor = scripting.forceWrite(false);
I2C1.sclPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
I2C1.sclPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric10";

PWM1.$name                      = "PWM_0";
PWM1.clockDivider               = 8;
PWM1.timerStartTimer            = true;
PWM1.peripheral.$assign         = "TIMA1";
PWM1.peripheral.ccp0Pin.$assign = "PA17";
PWM1.peripheral.ccp1Pin.$assign = "PA16";
PWM1.PWM_CHANNEL_0.$name        = "ti_driverlib_pwm_PWMTimerCC0";
PWM1.PWM_CHANNEL_0.invert       = true;
PWM1.PWM_CHANNEL_1.$name        = "ti_driverlib_pwm_PWMTimerCC1";
PWM1.PWM_CHANNEL_1.invert       = true;
PWM1.ccp0PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric5";
PWM1.ccp1PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric6";

PWM2.$name                      = "PWM_1";
PWM2.clockDivider               = 8;
PWM2.timerStartTimer            = true;
PWM2.peripheral.$assign         = "TIMG6";
PWM2.peripheral.ccp0Pin.$assign = "PB26";
PWM2.peripheral.ccp1Pin.$assign = "PB27";
PWM2.PWM_CHANNEL_0.$name        = "ti_driverlib_pwm_PWMTimerCC2";
PWM2.PWM_CHANNEL_0.invert       = true;
PWM2.PWM_CHANNEL_1.$name        = "ti_driverlib_pwm_PWMTimerCC3";
PWM2.PWM_CHANNEL_1.invert       = true;
PWM2.ccp0PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric7";
PWM2.ccp1PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric8";

SYSCTL.clockTreeEn = true;

TIMER1.$name              = "TIMER_0";
TIMER1.timerMode          = "PERIODIC_UP";
TIMER1.interrupts         = ["ZERO"];
TIMER1.timerStartTimer    = true;
TIMER1.interruptPriority  = "2";
TIMER1.timerClkDiv        = 8;
TIMER1.timerPeriod        = "5ms";
TIMER1.peripheral.$assign = "TIMG0";

TIMER2.$name              = "TIMER_GD";
TIMER2.timerPeriod        = "5 ms";
TIMER2.timerClkDiv        = 4;
TIMER2.timerMode          = "PERIODIC_UP";
TIMER2.timerStartTimer    = true;
TIMER2.peripheral.$assign = "TIMA0";

TIMER3.$name            = "TIMER_1";
TIMER3.timerPeriod      = "50 ms";
TIMER3.timerClkDiv      = 8;
TIMER3.timerClkPrescale = 5;
TIMER3.timerMode        = "PERIODIC_UP";
TIMER3.timerStartTimer  = true;
TIMER3.interrupts       = ["ZERO"];

UART1.$name                    = "UART_0";
UART1.enabledInterrupts        = ["RX"];
UART1.targetBaudRate           = 115200;
UART1.uartClkSrc               = "MFCLK";
UART1.peripheral.rxPin.$assign = "PA11";
UART1.peripheral.txPin.$assign = "PA10";
UART1.txPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric0";
UART1.rxPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric1";

ProjectConfig.deviceSpin = "MSPM0G3507";
scripting.suppress("Migrating requires going through the Switch Board or Device menu in the Device View section\\.", ProjectConfig, "deviceSpin");

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
GPIO1.associatedPins[1].pin.$suggestSolution = "PB22";
GPIO2.associatedPins[0].pin.$suggestSolution = "PB21";
GPIO3.associatedPins[0].pin.$suggestSolution = "PA14";
GPIO3.associatedPins[1].pin.$suggestSolution = "PA15";
GPIO3.associatedPins[2].pin.$suggestSolution = "PA12";
GPIO3.associatedPins[3].pin.$suggestSolution = "PA13";
GPIO3.associatedPins[4].pin.$suggestSolution = "PB17";
GPIO3.associatedPins[5].pin.$suggestSolution = "PB18";
GPIO3.associatedPins[6].pin.$suggestSolution = "PA8";
GPIO3.associatedPins[7].pin.$suggestSolution = "PA9";
GPIO4.associatedPins[0].pin.$suggestSolution = "PA27";
GPIO4.associatedPins[1].pin.$suggestSolution = "PA26";
GPIO4.associatedPins[4].pin.$suggestSolution = "PB10";
GPIO4.associatedPins[5].pin.$suggestSolution = "PB11";
GPIO4.associatedPins[6].pin.$suggestSolution = "PB12";
GPIO4.associatedPins[7].pin.$suggestSolution = "PB13";
GPIO5.associatedPins[0].pin.$suggestSolution = "PA1";
GPIO5.associatedPins[1].pin.$suggestSolution = "PA0";
TIMER3.peripheral.$suggestSolution           = "TIMG7";
UART1.peripheral.$suggestSolution            = "UART0";
